import random
import requests

url = 'https://docs.google.com/forms/d/e/1FAIpQLScOetUNtauNKGEZQW33SuGf6r0YsmtteNAw3RrKNT6RKLcHKQ/formResponse'

names = [
    'Шкунов Георгий Фёдорович',
'Шестопалов Никита Андреевич',
'Хасанова Ольга Олеговна',
'Фролова Алёна Сергеевна',
'Фисак Елизавета Дмитриевна',
'Сорокина Татьяна Денисовна',
'Сабирова Регина Рустамовна',
'Родина Елена Евгеньевна',
'Резинкин Георгий Андреевич',
'Прозоркевич Даниил Андреевич',
'Попова Мария Анатольевна',
'Попов Роман Сергеевич',
'Парамонова Екатерина Вадимовна',
'Олешко Екатерина Романовна',
'Огибалова Эвелина Максимовна',
'Новиков Алексей Алексеевич',
'Нгуен Ле Минь',
'Корома Ширли',
'Корогодин Андрей Дмитриевич',
'Карсанова Элина Игоревна',
'Каверина Анастасия Алексеевна',
'Забелина Дарья Александровна',
'Жеребцова Елена Александровна',
'Гуламова Сабина Рахимовна',
'Бушкевич Дарья Александровна',
'Барбато Вероника',
'Астафьева Ксения Ильинична',
'Амирханян Нелли Арутюновна']

def parse(name):
    form_data = {'entry.1349896692': f'МШБиМЭ 15.06Д-Э03а/19б {name}',
'entry.584616688': 'двигательное действие выполняемое под контролем сознания',
'entry.899874511': 'автоматизированное двигательное действие',
'entry.558565327': 'Практическую реализацию процесса решения двигательной задачи',
'entry.300853144': 'Все вышеперечисленные варианты',
'entry.2001677046': 'Знание - Умение - Навык (ЗУН)',
'entry.1632937374': 'все вышеперечисленные варианты',
'entry.447663809': 'Ознакомление с общей структурой упражнения',
'entry.1016115081': '10 000',
'entry.93857772': 'три фазы',
'entry.420695293': 'технической подготовкой',
'fvv': '1',
'draftResponse': '[]',
'pageHistory': '0'}
    user_agent = {'Referer':'https://docs.google.com/forms/d/e/1FAIpQLScOetUNtauNKGEZQW33SuGf6r0YsmtteNAw3RrKNT6RKLcHKQ/viewform','User-Agent': "Mozilla/5.0 (X11; Linux i686) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/28.0.1500.52 Safari/537.36"}
    r = requests.post(url, data=form_data, headers=user_agent)

    print(r)

for name in names:
    parse(name)
