text = 'Ребята, шуруйте сюда, дело есть!'

text = list(text)
id_list = ['287832212', #Нелли
           '236660289', #Ксюша
           '138311032', #Вероника
           '559865714', #Даша
           '153891766', #Сабина
           '170909883', #Лена
           '272793405', #Даша
           '151001142', #Настя
           '171167620', #Эля
           '233650513', #Андрей
           '553020288', #Ширли
           '512305141', #Минь
           '164516472', #Лёха
           '136980672', #Эва
           '133737204', #Катя
           '185944198', #Катя
           '98522023', #Рома
           '153403482', #Маша
           '185510152', #Даня
           '140182327', #Гера
           '351550164', #Лена
           '106541075', #Регина
           '236692025', #Таня
           '159082874', #Лиза
           
           '174568808', #Оля
           '174489018', #Никита
           '63605684', #Гоша
           '487965904', #Алёна
           ]

num = 0

for letter in range(len(text)):
    if text[letter] != ' ':
        text[letter] = f'[id{id_list[num]}|{text[letter]}]'
        num += 1

text = ''.join(text)

print(text)
